AccumulationRegisters/ЗаказыПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПоставщикам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Потолок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаказыПоставщикам/Ext/ManagerModule.bsl
//Возвращает ИСТИНА, если остатков по заказу хватает и ЛОЖЬ, если не закрытых заказов меньше, чем пытаемся оприходовать
Функция КонтрольОстатков(Знач Документ, Знач Заказ,Знач ТаблицаТовары, Знач ДатаДвижения = Неопределено) Экспорт
	
	Результат = Истина;
	
	Если (ДатаДвижения = Неопределено) или (ДатаДвижения = Дата(1,1,1)) Тогда
		ДатаДвижения = Документ.Дата;
	КонецЕсли;
	
	ВремТаблицаТовары = Новый ТаблицаЗначений;
	ВремТаблицаТовары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ВремТаблицаТовары.Колонки.Добавить("Количество",Новый ОписаниеТипов("число"));
	ВремТаблицаТовары.Колонки.Добавить("Коэффициент",Новый ОписаниеТипов("число"));
	ВремТаблицаТовары.Колонки.Добавить("Потолок", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ВремТаблицаТовары.Колонки.Добавить("Заказ");
	МассивТиповЕдиницИзмерения = Новый Массив;
	МассивТиповЕдиницИзмерения.Добавить(Тип("СправочникСсылка.ЕдиницыИзмерений"));
	МассивТиповЕдиницИзмерения.Добавить(Тип("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ВремТаблицаТовары.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов(МассивТиповЕдиницИзмерения));
	Для Каждого ТекущаяСтрока Из ТаблицаТовары Цикл
		НоваяСтрока = ВремТаблицаТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		НоваяСтрока.Заказ = Заказ;
	КонецЦикла;
	
	Запрос = Новый Запрос;
		
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Потолок КАК Потолок,
	|	ТаблицаТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВЫРАЗИТЬ(ТаблицаТовары.Количество * ТаблицаТовары.Коэффициент КАК ЧИСЛО(15, 2)) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТоварыВрем
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТоварыВрем.Номенклатура КАК Номенклатура,
	|	ВТ_ТоварыВрем.Потолок КАК Потолок,
	|	ВТ_ТоварыВрем.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(ВТ_ТоварыВрем.Количество) КАК Количество
	|ПОМЕСТИТЬ ТаблицаТовары
	|ИЗ
	|	ВТ_ТоварыВрем КАК ВТ_ТоварыВрем
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТоварыВрем.Номенклатура,
	|	ВТ_ТоварыВрем.Потолок,
	|	ВТ_ТоварыВрем.ЕдиницаИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокСписания.Номенклатура КАК Номенклатура,
	|	ДокСписания.Потолок КАК Потолок,
	|	ДокСписания.Количество КАК Количество,
	|	ДокСписания.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК КоличествоОстаток
	|ИЗ
	|	ТаблицаТовары КАК ДокСписания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПоставщикам.Остатки(&ТекДата, ЗаказПоставщику = &Заказ) КАК Остатки
	|		ПО (Остатки.Номенклатура = ДокСписания.Номенклатура)
	|			И (Остатки.Потолок = ДокСписания.Потолок)
	|			И (Остатки.ЕдиницаИзмерения = ДокСписания.ЕдиницаИзмерения)";
	
	Запрос.УстановитьПараметр("ДокументСписания",Документ);
	Запрос.УстановитьПараметр("ТекДата",ДатаДвижения);
	Запрос.УстановитьПараметр("Заказ",Заказ);
	Запрос.УстановитьПараметр("ТаблицаТовары",ВремТаблицаТовары);
	
	ВыборкаНоменклатура = Запрос.Выполнить().Выгрузить();
	Для Каждого ВыборкаСписание Из ВыборкаНоменклатура Цикл
		Если ВыборкаСписание.КоличествоОстаток < ВыборкаСписание.Количество Тогда
			Сообщить("По " + Заказ + " приходуется " + ВыборкаСписание.Номенклатура + ?(ВыборкаСписание.Потолок.Пустая(),""," для потолка " + ВыборкаСписание.Потолок) + " в количестве = " + ВыборкаСписание.Количество + ", остаток по заказу = " + ВыборкаСписание.КоличествоОстаток + " (" + ВыборкаСписание.ЕдиницаИзмерения + ")", СтатусСообщения.Важное);
			Результат = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;

	
КонецФункции

Функция ПолучитьТоварыКСписанию(Знач Дата, Знач ЗаказПоставщику, Знач Организация, Знач ТаблицаТовары, Знач ДокументПоступления = Неопределено) Экспорт
	
	ТаблицаТоварыДляЗапроса = Новый ТаблицаЗначений;
	ТаблицаТоварыДляЗапроса.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаТоварыДляЗапроса.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаТоварыДляЗапроса.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаТоварыДляЗапроса.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТаблицаТоварыДляЗапроса.Колонки.Добавить("Потолок", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаТоварыДляЗапроса.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	ТаблицаТоварыДляЗапроса.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	МассивТиповЕдиницИзмерения = Новый Массив;
	МассивТиповЕдиницИзмерения.Добавить(Тип("СправочникСсылка.ЕдиницыИзмерений"));
	МассивТиповЕдиницИзмерения.Добавить(Тип("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблицаТоварыДляЗапроса.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов(МассивТиповЕдиницИзмерения));
	
	Для Каждого ТекущаяСтрока Из ТаблицаТовары Цикл
		НоваяСтрока = ТаблицаТоварыДляЗапроса.Добавить();
		НоваяСтрока.НомерСтроки = ТекущаяСтрока.НомерСтроки;
		НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
		НоваяСтрока.Количество = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
		НоваяСтрока.Потолок = ТекущаяСтрока.Потолок;
		НоваяСтрока.Цена = ТекущаяСтрока.Цена;
		НоваяСтрока.ЕдиницаИзмерения = ТекущаяСтрока.ЕдиницаИзмерения;
		НоваяСтрока.Сумма = ТекущаяСтрока.Сумма;
	КонецЦикла;
	
	Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("ТаблицаТоварыДляЗапроса",ТаблицаТоварыДляЗапроса);
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.УстановитьПараметр("ДокументПоступления", ДокументПоступления);
	Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст = 
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
    |	ТаблицаТоваров.Номенклатура КАК Номенклатура,
    |	ТаблицаТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
    |	ТаблицаТоваров.Количество КАК КоличествоДокумента,
    |	ТаблицаТоваров.Потолок КАК Потолок,
    |	ТаблицаТоваров.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
    |	ТаблицаТоваров.Цена КАК Цена,
	|	ТаблицаТоваров.Сумма КАК Сумма
    |ПОМЕСТИТЬ ВТ_ТаблицаТоваров
    |ИЗ
    |	&ТаблицаТоварыДляЗапроса КАК ТаблицаТоваров
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыПоставщикамОбороты.Номенклатура КАК Номенклатура,
    |	ЗаказыПоставщикамОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
    |	ЗаказыПоставщикамОбороты.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
    |	ЗаказыПоставщикамОбороты.Цена КАК Цена,
    |	ЗаказыПоставщикамОбороты.Потолок КАК Потолок,
    |	ЕСТЬNULL(СУММА(ЗаказыПоставщикамОбороты.КоличествоПриход) - СУММА(ЗаказыПоставщикамОбороты.КоличествоРасход), 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(СУММА(ЗаказыПоставщикамОбороты.СуммаПриход) - СУММА(ЗаказыПоставщикамОбороты.СуммаРасход), 0) КАК СуммаОстаток
	|ПОМЕСТИТЬ ВТ_Обороты
    |ИЗ
    |	РегистрНакопления.ЗаказыПоставщикам.Обороты(, &Дата, Регистратор, ЗаказПоставщику = &ЗаказПоставщику И Организация = &Организация) КАК ЗаказыПоставщикамОбороты    
    |ГДЕ
    |	ЗаказыПоставщикамОбороты.Регистратор <> &ДокументПоступления
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПоставщикамОбороты.Номенклатура,
    |	ЗаказыПоставщикамОбороты.ХарактеристикаНоменклатуры,
    |	ЗаказыПоставщикамОбороты.ЕдиницаИзмерения,
    |	ЗаказыПоставщикамОбороты.Цена,
    |	ЗаказыПоставщикамОбороты.Потолок
	|;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ЗаказыПоставщикамОбороты.Номенклатура КАК Номенклатура,
    |	ЗаказыПоставщикамОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
    |	ЗаказыПоставщикамОбороты.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
    |	ЗаказыПоставщикамОбороты.Цена КАК Цена,
    |	ЗаказыПоставщикамОбороты.Потолок КАК Потолок,
    |	ВЫБОР
    |		КОГДА ТИПЗНАЧЕНИЯ(ЗаказыПоставщикамОбороты.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
    |			ТОГДА 1
    |		ИНАЧЕ ЗаказыПоставщикамОбороты.ЕдиницаИзмерения.Коэффициент
    |	КОНЕЦ КАК Коэффициент,
    |	ВЫБОР
    |		КОГДА ЕСТЬNULL(ЗаказыПоставщикамОбороты.КоличествоОстаток, 0) > ТаблицаТоваров.КоличествоДокумента
    |			ТОГДА ТаблицаТоваров.КоличествоДокумента
    |		ИНАЧЕ ВЫБОР
    |				КОГДА ЕСТЬNULL(ЗаказыПоставщикамОбороты.КоличествоОстаток, 0) <= ТаблицаТоваров.КоличествоДокумента
    |					ТОГДА ЕСТЬNULL(ЗаказыПоставщикамОбороты.КоличествоОстаток, 0)
    |				ИНАЧЕ 0
    |			КОНЕЦ
    |	КОНЕЦ КАК Количество,
	|	ВЫБОР
    |		КОГДА ЕСТЬNULL(ЗаказыПоставщикамОбороты.СуммаОстаток, 0) > ТаблицаТоваров.Сумма
    |			ТОГДА ТаблицаТоваров.Сумма
    |		ИНАЧЕ ВЫБОР
    |				КОГДА ЕСТЬNULL(ЗаказыПоставщикамОбороты.СуммаОстаток, 0) <= ТаблицаТоваров.Сумма
    |					ТОГДА ЕСТЬNULL(ЗаказыПоставщикамОбороты.СуммаОстаток, 0)
    |				ИНАЧЕ 0
    |			КОНЕЦ
    |	КОНЕЦ КАК Сумма
    |ИЗ
    |	ВТ_Обороты КАК ЗаказыПоставщикамОбороты
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаТоваров КАК ТаблицаТоваров
    |		ПО ЗаказыПоставщикамОбороты.Номенклатура = ТаблицаТоваров.Номенклатура
    |			И ЗаказыПоставщикамОбороты.Потолок = ТаблицаТоваров.Потолок
    |			И ЗаказыПоставщикамОбороты.ХарактеристикаНоменклатуры = ТаблицаТоваров.ХарактеристикаНоменклатуры
    |			И ЗаказыПоставщикамОбороты.Цена = ТаблицаТоваров.Цена
    |			И ЗаказыПоставщикамОбороты.ЕдиницаИзмерения = ТаблицаТоваров.ЕдиницаИзмерения
    |ГДЕ
    |	ЕСТЬNULL(ЗаказыПоставщикамОбороты.КоличествоОстаток, 0) > 0
    |
    |УПОРЯДОЧИТЬ ПО
    |	ТаблицаТоваров.НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Для каждого СтрокаТЗ из РезультатЗапроса Цикл
		Если СтрокаТЗ.Коэффициент <> 0 Тогда 
			СтрокаТЗ.Количество	= СтрокаТЗ.Количество / СтрокаТЗ.Коэффициент;
		КонецЕсли;
	КонецЦикла;
		
	Возврат РезультатЗапроса;
    	
КонецФункции
